productsData = [{
    
	"id" : "1",
	"name" : "	एग्री माइक्रोराजा",
	"href" : "products/1",
	"imgPath" : "static/assets/images/project/product-1.png",
 "bannerImg" : "/assets/images/products/banner-1.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p1.jpg",
	"pageImgTwo" : "/assets/images/products/1.jpg",
 "data" : '''पौधों के लिए आवश्यक सभी 16 पोषक तत्वों की अनिवार्य रूप से आवश्यकता होती है। जड़ ग्रन्थियों में बैक्टीरिया उपलब्ध कराता है। जिससे दलहनी एवं अनाज वाली फसलों से अधिक उत्पादन प्राप्त होता है।

पौधों के अन्दर प्रोटिन्स, कार्बोहाइड्रेटस एवं विटामिन वृद्धिवर्धक हार्मोन्स इत्यादि की क्रियाशीलता बढ़ाता है। जिससे पौधों की एक समान वृद्धि होती है, और रोगो से लड़ने की क्षमता में विकास होता है। 2. पौधों में क्लोरोफिल निर्माण में सहयोग करके वानस्पतिक वृद्धि करता है। पौधों में जड़ों का विकास करता है। 3. कन्द वाली फसलों में एक समान और अधिक कन्द बनाने में मदद करता है 4. सीढ़ियों की फसलों में बेएलडोज में प्रथम हाप डेसिंग में यूरिया के साथ प्रयोग करने से अधिक और स्वस्थ फूल, फल प्राप्त होते है। पौधों में कोशिका निर्माण को बढ़ाता है।
'''
	},
                {
	"id" : "2",
	"name" : "	एग्री फेरस सल्फेट",
	"href" : "products/2",
 "imgPath" : "static/assets/images/project/product-2.png",
 "bannerImg" : "/assets/images/products/banner-2.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p2.jpg",
	"pageImgTwo" : "/assets/images/products/2.jpg",
 "data" : '''विशेषतायें : एग्री फेरस सल्फेट आयरन युक्त उत्पाद है, यह क्लोरोफिल के निर्माण में सहायक है। यह प्रकाश संश्लेषण की प्रक्रिया में महत्वपूर्ण योगदान करता है। यह कोशिका एवं प्रोटीन में सहायक है। यह फसलों को हरा बनाये रखता है। यह पौधों के विकास के साथ के उत्पादन एवं गुणवत्ता में वृद्धि करता है।

फसलें : धान, गेहूँ, गन्ना, मक्का, मूंगफली, सोयाबीन, तम्बाकू, मेंथा, ज्वार, कपास दलहन, व तिलहन, सब्जियों तथा सभी प्रकार की फसलों में लाभकारी है।
'''
	},
                {
	"id" : "3",
	"name" : "	एग्री मैग्नीशियम",
	"href" : "products/3",
 "imgPath" : "static/assets/images/project/product-3.png",
 "bannerImg" : "/assets/images/products/banner-3.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p3.jpg",
	"pageImgTwo" : "/assets/images/products/3.jpg",
 "data" : '''विशेषताएँ : एग्री मैग्नीशियम एक सूक्ष्म पोषक तत्व है। जिसमें मैग्नीशियम 9.6 प्रतिशत एवं सल्फर 12 प्रतिशत पाया जाता है। एग्री मैग्नीशियम पौधों में क्लोरोफिल का निर्माण करने में महत्वपूर्ण भूमिका निभाता है, जिससे पौधों का भरपूर विकास होता है। एग्री मैग्नीशियम के प्रयोग से फसलों की गुणवत्ता में वृद्धि होती है, जिससे पैदावार में बढ़ोत्तरी होती है। फसलें गन्ना, गेहूँ, धान, मक्का, मेन्था, आलू, मूंगफली, मटर, चना, तम्बाकू, टमाटर, प्याज, मिर्च, गोभी, सरसों, सोयाबिन, वलहनी व तिलहनी फसलों में उपयोग हेतु।'''
	},
                {
	"id" : "4",
	"name" : "	एग्री गोल्ड कैल्शियम",
	"href" : "products/4",
 "imgPath" : "static/assets/images/project/product-4.png",
 "bannerImg" : "/assets/images/products/banner-4.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p4.jpg",
	"pageImgTwo" : "/assets/images/products/4.jpg",
 "data" : '''उपयोगिता : एग्री गोल्ड कैल्शियम में कैल्शियम, मैग्नीशियम, फास्फोरस, नाइट्रोजन की मात्रा प्रचुर रूप में पाई जाती है। इसमें अन्य पोषक तत्व जिंक, आयरन, मैग्नीज बोरान आवि उपलब्ध है। एग्री गोल्ड कैल्शियम का भूमि में उपयोग करने पर भूमि की उर्वरा शक्ति बढ़ती है। पौधों की उपज में वृद्धि एवं गुणवत्ता में सहायक है। एग्री गोल्ड कैल्शियम के प्रयोग से फसलों की जड़ें, कन्द और गांदों की संख्या बढ़ जाती है। जिससे उपज में वृद्धि होती है। फसलें धान, गेहूँ, गन्ना, मक्का, आलू, ज्वार, बाजरा सरसों, मैंन्या, तम्बाकू, केला एवं सभी प्रकार की दलहन व तिलहन, फसलों फलों एवं सब्जियों में लाभकारी है।'''
	},
                {
	"id" : "5",
	"name" : "	एग्री फास्फेट प्रोम",
	"href" : "products/5",
 "imgPath" : "static/assets/images/project/product-5.png",
 "bannerImg" : "/assets/images/products/banner-1.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p5.jpg",
	"pageImgTwo" : "/assets/images/products/5.jpg",
 "data" : '''रासायनिक खाद एवं कीटनाशक के अत्याधिक उपयोग से मिट्टी में होने वाले दुष्प्रभाव को एग्री फास्फेट प्रोम, डालकर कम किया जा सकता है। इसके उपयोग से भूमि में कार्बन का स्तर बढ़ जाता है। जिसके फलस्वरूप मिट्टी में सूक्ष्म जीवाणुओं का विकास होता है। तथा मिट्टी भुर-भुरी होती है। इसके प्रयोग से मिट्टी में कार्बन, हाइड्रोजन व ऑक्सीजन का समुचित प्रवेश होता है। इसके प्रयोग से मिट्टी का चे भी संतुलित होता है। जिससे परिणामस्वरूप मिट्टी को जलीय एवं क्षारीय होने से बचाया जा सकता है।'''
	},
                {
	"id" : "6",
	"name" : "एग्री सल्फर (Sulphur 90% DP Powder)",
	"href" : "products/6",
 "imgPath" : "static/assets/images/project/product-6.png",
 "bannerImg" : "/assets/images/products/banner-2.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p6.jpg",
	"pageImgTwo" : "/assets/images/products/6.jpg",
 "data" : '''कमी के लक्षण: पत्तियों में हल्के पीले रंग के दाग पड़ जाते हैं, और पत्तियों में क्लोरोफिल की कमी हो जाती है, जिसके कारण पौधे सुचारू रूप से भोजन नहीं बना पाते हैं। पौधों की बढ़वार रूक जाती है।, उपयोग : गेहूँ, गन्ना, धान, आलू, मटर, मूंगफली, प्याज, भिन्डी आदि फसलों में उपयोगी है। इसके प्रयोग से उपज में वृदि होती है। एग्री सल्फर भूमि व फसलों की सल्फर तत्व की कमी दूर कर अधिक पैदावार में सहायक है।'''
	},
                {
	"id" : "7",
	"name" : "	एग्री ग्रीन गोल्ड",
	"href" : "products/7",
 "imgPath" : "static/assets/images/project/product-7.png",
 "bannerImg" : "/assets/images/products/banner-3.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p7.jpg",
	"pageImgTwo" : "/assets/images/products/7.jpg",
 "data" : '''लाभ : एग्री ग्रीन गोल्ड हार्मोंस को प्ररित कर फूल और फलों को बढ़ाता है। यह पौधों को पोषक पदार्थों के ग्रहण करने की शक्ति देकर फलों के रंग, परिणाम तथा स्वाद को बढ़ाता है। प्रतिकूल परिस्थितयों से पौधों को बचाता है। पौधों की अवरोधक शक्तियों से बचाने व सहन करने की क्षमता शक्ति को बढ़ाता है तथा इस प्रकार इसके प्रभावी प्रयोग से फसलों की स्वस्थ वृद्धि होकर गुणवत्ता व उत्पादन में अत्याधिक बढ़ोत्तरी होती है। कीड़ों, बीमारियों तथा वातावरण के तनावों का सामना करने के लिए पौधों की शक्ति बढ़ाता है।'''
	},
                {
	"id" : "8",
	"name" : "एग्री शक्ति गोल्ड (MICRO 6 0/0%)",
	"href" : "products/8",
 "imgPath" : "static/assets/images/project/product-8.png",
 "bannerImg" : "/assets/images/products/banner-4.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p8.jpg",
	"pageImgTwo" : "/assets/images/products/8.jpg",
 "data" : '''सभी सूक्ष्म पोषक तत्वों की उपलब्धता जड़ों, कल्लों व तनों के विकास में सहायक पेड़ों (बौर) का गिरना रोक कर अधिक फूल/फल' न पैदावार बढ़ायें। उपज व दाने का आकार बड़ा, सुन्दर व सुगठित बनाये। पौधों की रोग प्रतिरोधक शक्ति बढ़ाता है। पाले के प्रति सहनशीलता बढ़ाता है। आवश्यक एंजाइम, प्रोटीन, हारमोन, कार्बोहाइड्रेट, क्लोरोफिल का निर्माण व क्रियाशीलता बढ़ाता है।'''
	},
                {
	"id" : "9",
	"name" : "	एग्री समृद्धि (MICRO 3%)",
	"href" : "products/9",
 "imgPath" : "static/assets/images/project/product-9.png",
 "bannerImg" : "/assets/images/products/banner-1.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p9.jpg",
	"pageImgTwo" : "/assets/images/products/9.jpg",
 "data" : "सभी सूक्ष्म पोषक तत्वों की उपलब्धता जड़ों, कल्लों व तनों के विकास में सहायक पेड़ों (बौर) का गिरना रोक कर अधिक फूल/फल पैदावार बढ़ायें। उपज व दाने का आकार बड़ा, सुन्दर व सुगठित बनाये। पौधों की रोग प्रतिरोधक शक्ति बढ़ाता है। पाले के प्रति सहनशीलता बढ़ाता है। आवश्यक एंजाइम, प्रोटीन, हारमोन, कार्बोहाइड्रेट, क्लोरोफिल का निर्माण व क्रियाशीलता बढ़ाता है।"
	},
                {
	"id" : "10",
	"name" : "	एग्री फसल शक्ति (MICRO 10%)",
	"href" : "products/10",
 "imgPath" : "static/assets/images/project/product-10.png",
 "bannerImg" : "/assets/images/products/banner-2.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p10.jpg",
	"pageImgTwo" : "/assets/images/products/10.jpg",
 "data" : '''1 सभी सूक्ष्म पोषक तत्वों की उपलब्धता।
2 रोगों से प्रति रोधक शक्ति बढ़ाये।
3 जड़ों, कल्लों व तने के विकास में सहायक ।
4 हिमपात (पाले) के प्रति सहनशीलता बढ़ाये ।
5 पेड़ों से फूलों (बोर) का गिरना रोक कर अधिक फूल / फल पैदावार बढ़ाये ।
6 आवश्यक एंजाइम, प्रोटीन, हारमोन, कार्बोहाइड्रेट, क्लोरोफिल के निर्माण व क्रियाशीलता बढ़ाये।
7 उपज व दाने का आकार बड़ा, सुन्दर व सुगठित बनाये।
'''
	},
                {
	"id" : "11",
	"name" : "	एग्री बायो पोटाश",
	"href" : "products/11",
 "imgPath" : "static/assets/images/project/product-11.png",
 "bannerImg" : "/assets/images/products/banner-3.jpg",
	"pageImgOne" : "/assets/images/products/product-inside/p11.jpg",
	"pageImgTwo" : "/assets/images/products/11.jpg",
 "data" : '''1. एग्री पोटाश एक बेहतरीन जैव उत्पाद है ये मिट्टी में घुलनशील पोटाश को घुलनशील बनाकर पौधों को उपलब्ध कराता है। 
2. यह प्रकाश संश्लेषण व श्वसन क्रिया में उपयोगी एन्जाइमों की क्रियाशीलता को बढ़ाता है और पौधों को सूखने से बचाता है। 
3. बीमारियों के प्रति सहनशीलता प्रदान करता है। 
4. पौधों में जल संतुलन बनाये रखता है, एवं रोमछिद्र की क्रियाशीलता को नियंत्रित करता है। 
5. अनाज व बीज की गुणवत्ता में बढ़ोतरी करता है, एवं उत्पाद को चमकदार बनाता है। 
6. एम. ओ. पी. इत्यादि रासायनिक खादों की आवश्यकता को कम करता है।
'''
	}
	
]

def getAllData():
    return productsData

def getOneData(id):
    for product in productsData:
        if str(product['id']) == id:
            return product